; domain
(define (domain satellite)
  (:requirements :typing :fluents :equality)
 (:types satellite direction instrument mode)
 (:predicates 
               (on_board ?i - instrument ?s - satellite)
	       (supports ?i - instrument ?m - mode)
	       (pointing ?s - satellite ?d - direction)
	       (power_avail ?s - satellite)
	       (power_on ?i - instrument)
	       (calibrated ?i - instrument)
	       (have_image ?d - direction ?m - mode)
	       (calibration_target ?i - instrument ?d - direction))
 
 

  (:functions (data_capacity ?s - satellite)
	      (data ?d - direction ?m - mode)
		(slew_time ?a ?b - direction)
		(data-stored)
		(fuel ?s - satellite)
		(fuel-used)
  )

  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev)
                   (not (= ?d_new ?d_prev))
		(>= (fuel ?s) (slew_time ?d_new ?d_prev))
              )
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))
		(decrease (fuel ?s) (slew_time ?d_new ?d_prev))
		(increase (fuel-used) (slew_time ?d_new ?d_prev))
           )
  )

 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
 
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s)
                 )
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))
           )
          
  )

 
  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
 
   :precondition (and (on_board ?i ?s)
                      (power_on ?i) 
                  )
   :effect (and (not (power_on ?i))
                (power_avail ?s)
           )
  )

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i)
                  )
   :effect (calibrated ?i)
  )
 

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d)
                      (power_on ?i)
			  (>= (data_capacity ?s) (data ?d ?m))
               )
   :effect (and (decrease (data_capacity ?s) (data ?d ?m)) (have_image ?d ?m)
		(increase (data-stored) (data ?d ?m)))
  )
)

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	infrared2 - mode
	thermograph0 - mode
	spectrograph1 - mode
	thermograph3 - mode
	Star1 - direction
	Star2 - direction
	GroundStation3 - direction
	GroundStation4 - direction
	Star0 - direction
	Star5 - direction
	Phenomenon6 - direction
	Star7 - direction
	Phenomenon8 - direction
	Phenomenon9 - direction
	Phenomenon10 - direction
)
(:init
	(supports instrument0 thermograph3)
	(supports instrument0 spectrograph1)
	(supports instrument0 thermograph0)
	(calibration_target instrument0 Star0)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Phenomenon10)
	(= (data_capacity satellite0) 1000)
	(= (fuel satellite0) 129)
	(= (data Star5 infrared2) 219)
	(= (data Phenomenon6 infrared2) 29)
	(= (data Star7 infrared2) 96)
	(= (data Phenomenon8 infrared2) 253)
	(= (data Phenomenon9 infrared2) 145)
	(= (data Phenomenon10 infrared2) 142)
	(= (data Star5 thermograph0) 9)
	(= (data Phenomenon6 thermograph0) 47)
	(= (data Star7 thermograph0) 287)
	(= (data Phenomenon8 thermograph0) 68)
	(= (data Phenomenon9 thermograph0) 179)
	(= (data Phenomenon10 thermograph0) 75)
	(= (data Star5 spectrograph1) 145)
	(= (data Phenomenon6 spectrograph1) 230)
	(= (data Star7 spectrograph1) 213)
	(= (data Phenomenon8 spectrograph1) 119)
	(= (data Phenomenon9 spectrograph1) 11)
	(= (data Phenomenon10 spectrograph1) 288)
	(= (data Star5 thermograph3) 113)
	(= (data Phenomenon6 thermograph3) 292)
	(= (data Star7 thermograph3) 200)
	(= (data Phenomenon8 thermograph3) 166)
	(= (data Phenomenon9 thermograph3) 158)
	(= (data Phenomenon10 thermograph3) 254)
	(= (slew_time Star1 Star0) 10.65)
	(= (slew_time Star0 Star1) 10.65)
	(= (slew_time Star2 Star0) 66.55)
	(= (slew_time Star0 Star2) 66.55)
	(= (slew_time Star2 Star1) 9.608)
	(= (slew_time Star1 Star2) 9.608)
	(= (slew_time GroundStation3 Star0) 9.19)
	(= (slew_time Star0 GroundStation3) 9.19)
	(= (slew_time GroundStation3 Star1) 37.65)
	(= (slew_time Star1 GroundStation3) 37.65)
	(= (slew_time GroundStation3 Star2) 15.7)
	(= (slew_time Star2 GroundStation3) 15.7)
	(= (slew_time GroundStation4 Star0) 72.52)
	(= (slew_time Star0 GroundStation4) 72.52)
	(= (slew_time GroundStation4 Star1) 22.81)
	(= (slew_time Star1 GroundStation4) 22.81)
	(= (slew_time GroundStation4 Star2) 1.841)
	(= (slew_time Star2 GroundStation4) 1.841)
	(= (slew_time GroundStation4 GroundStation3) 43.1)
	(= (slew_time GroundStation3 GroundStation4) 43.1)
	(= (slew_time Star5 Star0) 91.08)
	(= (slew_time Star0 Star5) 91.08)
	(= (slew_time Star5 Star1) 3.205)
	(= (slew_time Star1 Star5) 3.205)
	(= (slew_time Star5 Star2) 8.228)
	(= (slew_time Star2 Star5) 8.228)
	(= (slew_time Star5 GroundStation3) 14.2)
	(= (slew_time GroundStation3 Star5) 14.2)
	(= (slew_time Star5 GroundStation4) 5.361)
	(= (slew_time GroundStation4 Star5) 5.361)
	(= (slew_time Phenomenon6 Star0) 5.213)
	(= (slew_time Star0 Phenomenon6) 5.213)
	(= (slew_time Phenomenon6 Star1) 7.032)
	(= (slew_time Star1 Phenomenon6) 7.032)
	(= (slew_time Phenomenon6 Star2) 7.935)
	(= (slew_time Star2 Phenomenon6) 7.935)
	(= (slew_time Phenomenon6 GroundStation3) 19.82)
	(= (slew_time GroundStation3 Phenomenon6) 19.82)
	(= (slew_time Phenomenon6 GroundStation4) 1.016)
	(= (slew_time GroundStation4 Phenomenon6) 1.016)
	(= (slew_time Phenomenon6 Star5) 14.97)
	(= (slew_time Star5 Phenomenon6) 14.97)
	(= (slew_time Star7 Star0) 48.11)
	(= (slew_time Star0 Star7) 48.11)
	(= (slew_time Star7 Star1) 81.23)
	(= (slew_time Star1 Star7) 81.23)
	(= (slew_time Star7 Star2) 25.87)
	(= (slew_time Star2 Star7) 25.87)
	(= (slew_time Star7 GroundStation3) 19.82)
	(= (slew_time GroundStation3 Star7) 19.82)
	(= (slew_time Star7 GroundStation4) 78.43)
	(= (slew_time GroundStation4 Star7) 78.43)
	(= (slew_time Star7 Star5) 45.9)
	(= (slew_time Star5 Star7) 45.9)
	(= (slew_time Star7 Phenomenon6) 25.39)
	(= (slew_time Phenomenon6 Star7) 25.39)
	(= (slew_time Phenomenon8 Star0) 47.22)
	(= (slew_time Star0 Phenomenon8) 47.22)
	(= (slew_time Phenomenon8 Star1) 54.23)
	(= (slew_time Star1 Phenomenon8) 54.23)
	(= (slew_time Phenomenon8 Star2) 10.88)
	(= (slew_time Star2 Phenomenon8) 10.88)
	(= (slew_time Phenomenon8 GroundStation3) 5.022)
	(= (slew_time GroundStation3 Phenomenon8) 5.022)
	(= (slew_time Phenomenon8 GroundStation4) 9.432)
	(= (slew_time GroundStation4 Phenomenon8) 9.432)
	(= (slew_time Phenomenon8 Star5) 41.08)
	(= (slew_time Star5 Phenomenon8) 41.08)
	(= (slew_time Phenomenon8 Phenomenon6) 5.778)
	(= (slew_time Phenomenon6 Phenomenon8) 5.778)
	(= (slew_time Phenomenon8 Star7) 68.61)
	(= (slew_time Star7 Phenomenon8) 68.61)
	(= (slew_time Phenomenon9 Star0) 21.95)
	(= (slew_time Star0 Phenomenon9) 21.95)
	(= (slew_time Phenomenon9 Star1) 84.36)
	(= (slew_time Star1 Phenomenon9) 84.36)
	(= (slew_time Phenomenon9 Star2) 5.915)
	(= (slew_time Star2 Phenomenon9) 5.915)
	(= (slew_time Phenomenon9 GroundStation3) 13.59)
	(= (slew_time GroundStation3 Phenomenon9) 13.59)
	(= (slew_time Phenomenon9 GroundStation4) 79.36)
	(= (slew_time GroundStation4 Phenomenon9) 79.36)
	(= (slew_time Phenomenon9 Star5) 13.31)
	(= (slew_time Star5 Phenomenon9) 13.31)
	(= (slew_time Phenomenon9 Phenomenon6) 16.87)
	(= (slew_time Phenomenon6 Phenomenon9) 16.87)
	(= (slew_time Phenomenon9 Star7) 45.19)
	(= (slew_time Star7 Phenomenon9) 45.19)
	(= (slew_time Phenomenon9 Phenomenon8) 24.75)
	(= (slew_time Phenomenon8 Phenomenon9) 24.75)
	(= (slew_time Phenomenon10 Star0) 54.9)
	(= (slew_time Star0 Phenomenon10) 54.9)
	(= (slew_time Phenomenon10 Star1) 7.926)
	(= (slew_time Star1 Phenomenon10) 7.926)
	(= (slew_time Phenomenon10 Star2) 62)
	(= (slew_time Star2 Phenomenon10) 62)
	(= (slew_time Phenomenon10 GroundStation3) 40.78)
	(= (slew_time GroundStation3 Phenomenon10) 40.78)
	(= (slew_time Phenomenon10 GroundStation4) 60.72)
	(= (slew_time GroundStation4 Phenomenon10) 60.72)
	(= (slew_time Phenomenon10 Star5) 34.58)
	(= (slew_time Star5 Phenomenon10) 34.58)
	(= (slew_time Phenomenon10 Phenomenon6) 5.388)
	(= (slew_time Phenomenon6 Phenomenon10) 5.388)
	(= (slew_time Phenomenon10 Star7) 20.7)
	(= (slew_time Star7 Phenomenon10) 20.7)
	(= (slew_time Phenomenon10 Phenomenon8) 13.27)
	(= (slew_time Phenomenon8 Phenomenon10) 13.27)
	(= (slew_time Phenomenon10 Phenomenon9) 73.74)
	(= (slew_time Phenomenon9 Phenomenon10) 73.74)
	(= (data-stored) 0)
	(= (fuel-used) 0)
)
(:goal (and
	(have_image Star7 thermograph3)
	(have_image Phenomenon8 thermograph0)
	(have_image Phenomenon10 spectrograph1)
))
(:metric minimize (fuel-used))

)

; plan
1. (turn_to satellite0 phenomenon6 phenomenon10)
   deleted: (pointing satellite0 phenomenon10)
   added: (pointing satellite0 phenomenon6)
   changed: (fuel satellite0) from 129 to 123.612, (fuel-used) from 0 to 5.388
   goals met: 0 of 3
2. (turn_to satellite0 phenomenon8 phenomenon6)
   deleted: (pointing satellite0 phenomenon6)
   added: (pointing satellite0 phenomenon8)
   changed: (fuel satellite0) from 123.612 to 117.834, (fuel-used) from 5.388 to 11.166
   goals met: 0 of 3
3. (turn_to satellite0 phenomenon6 phenomenon8)
   deleted: (pointing satellite0 phenomenon8)
   added: (pointing satellite0 phenomenon6)
   changed: (fuel satellite0) from 117.834 to 112.056, (fuel-used) from 11.166 to 16.944
   goals met: 0 of 3
4. (turn_to satellite0 phenomenon8 phenomenon6)
   deleted: (pointing satellite0 phenomenon6)
   added: (pointing satellite0 phenomenon8)
   changed: (fuel satellite0) from 112.056 to 106.278, (fuel-used) from 16.944 to 22.722
   goals met: 0 of 3
5. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 0 of 3
6. (turn_to satellite0 groundstation3 phenomenon8)
   deleted: (pointing satellite0 phenomenon8)
   added: (pointing satellite0 groundstation3)
   changed: (fuel satellite0) from 106.278 to 101.256, (fuel-used) from 22.722 to 27.744
   goals met: 0 of 3
7. (turn_to satellite0 phenomenon8 groundstation3)
   deleted: (pointing satellite0 groundstation3)
   added: (pointing satellite0 phenomenon8)
   changed: (fuel satellite0) from 101.256 to 96.234, (fuel-used) from 27.744 to 32.766
   goals met: 0 of 3
8. (turn_to satellite0 phenomenon6 phenomenon8)
   deleted: (pointing satellite0 phenomenon8)
   added: (pointing satellite0 phenomenon6)
   changed: (fuel satellite0) from 96.234 to 90.456, (fuel-used) from 32.766 to 38.544
   goals met: 0 of 3
9. (turn_to satellite0 star0 phenomenon6)
   deleted: (pointing satellite0 phenomenon6)
   added: (pointing satellite0 star0)
   changed: (fuel satellite0) from 90.456 to 85.243, (fuel-used) from 38.544 to 43.757
   goals met: 0 of 3
10. (turn_to satellite0 phenomenon6 star0)
   deleted: (pointing satellite0 star0)
   added: (pointing satellite0 phenomenon6)
   changed: (fuel satellite0) from 85.243 to 80.03, (fuel-used) from 43.757 to 48.97
   goals met: 0 of 3
11. (turn_to satellite0 phenomenon8 phenomenon6)
   deleted: (pointing satellite0 phenomenon6)
   added: (pointing satellite0 phenomenon8)
   changed: (fuel satellite0) from 80.03 to 74.252, (fuel-used) from 48.97 to 54.748
   goals met: 0 of 3
12. (turn_to satellite0 groundstation3 phenomenon8)
   deleted: (pointing satellite0 phenomenon8)
   added: (pointing satellite0 groundstation3)
   changed: (fuel satellite0) from 74.252 to 69.23, (fuel-used) from 54.748 to 59.77
   goals met: 0 of 3
13. (turn_to satellite0 phenomenon8 groundstation3)
   deleted: (pointing satellite0 groundstation3)
   added: (pointing satellite0 phenomenon8)
   changed: (fuel satellite0) from 69.23 to 64.208, (fuel-used) from 59.77 to 64.792
   goals met: 0 of 3
14. (turn_to satellite0 groundstation3 phenomenon8)
   deleted: (pointing satellite0 phenomenon8)
   added: (pointing satellite0 groundstation3)
   changed: (fuel satellite0) from 64.208 to 59.186, (fuel-used) from 64.792 to 69.814
   goals met: 0 of 3
15. (turn_to satellite0 phenomenon8 groundstation3)
   deleted: (pointing satellite0 groundstation3)
   added: (pointing satellite0 phenomenon8)
   changed: (fuel satellite0) from 59.186 to 54.164, (fuel-used) from 69.814 to 74.836
   goals met: 0 of 3
16. (turn_to satellite0 phenomenon6 phenomenon8)
   deleted: (pointing satellite0 phenomenon8)
   added: (pointing satellite0 phenomenon6)
   changed: (fuel satellite0) from 54.164 to 48.386, (fuel-used) from 74.836 to 80.614
   goals met: 0 of 3
17. (turn_to satellite0 star0 phenomenon6)
   deleted: (pointing satellite0 phenomenon6)
   added: (pointing satellite0 star0)
   changed: (fuel satellite0) from 48.386 to 43.173, (fuel-used) from 80.614 to 85.827
   goals met: 0 of 3
18. (calibrate satellite0 instrument0 star0)
   added: (calibrated instrument0)
   goals met: 0 of 3
19. (turn_to satellite0 phenomenon6 star0)
   deleted: (pointing satellite0 star0)
   added: (pointing satellite0 phenomenon6)
   changed: (fuel satellite0) from 43.173 to 37.96, (fuel-used) from 85.827 to 91.04
   goals met: 0 of 3
20. (turn_to satellite0 phenomenon8 phenomenon6)
   deleted: (pointing satellite0 phenomenon6)
   added: (pointing satellite0 phenomenon8)
   changed: (fuel satellite0) from 37.96 to 32.182, (fuel-used) from 91.04 to 96.818
   goals met: 0 of 3
21. (take_image satellite0 phenomenon8 instrument0 thermograph0)
   added: (have_image phenomenon8 thermograph0)
   changed: (data_capacity satellite0) from 1000 to 932, (data-stored) from 0 to 68
   goals met: 1 of 3
22. (turn_to satellite0 phenomenon6 phenomenon8)
   deleted: (pointing satellite0 phenomenon8)
   added: (pointing satellite0 phenomenon6)
   changed: (fuel satellite0) from 32.182 to 26.404, (fuel-used) from 96.818 to 102.596
   goals met: 1 of 3
23. (turn_to satellite0 phenomenon10 phenomenon6)
   deleted: (pointing satellite0 phenomenon6)
   added: (pointing satellite0 phenomenon10)
   changed: (fuel satellite0) from 26.404 to 21.016, (fuel-used) from 102.596 to 107.984
   goals met: 1 of 3
24. (take_image satellite0 phenomenon10 instrument0 spectrograph1)
   added: (have_image phenomenon10 spectrograph1)
   changed: (data_capacity satellite0) from 932 to 644, (data-stored) from 68 to 356
   goals met: 2 of 3
25. (turn_to satellite0 star7 phenomenon10)
   deleted: (pointing satellite0 phenomenon10)
   added: (pointing satellite0 star7)
   changed: (fuel satellite0) from 21.016 to 0.316, (fuel-used) from 107.984 to 128.684
   goals met: 2 of 3
26. (take_image satellite0 star7 instrument0 thermograph3)
   added: (have_image star7 thermograph3)
   changed: (data_capacity satellite0) from 644 to 444, (data-stored) from 356 to 556
   goals met: 3 of 3
